{
  "token_to_id": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    "FALSE": 4,
    "NONE": 5,
    "TRUE": 6,
    "AND": 7,
    "AS": 8,
    "ASSERT": 9,
    "ASYNC": 10,
    "AWAIT": 11,
    "BREAK": 12,
    "CLASS": 13,
    "CONTINUE": 14,
    "DEF": 15,
    "DEL": 16,
    "ELIF": 17,
    "ELSE": 18,
    "EXCEPT": 19,
    "FINALLY": 20,
    "FOR": 21,
    "FROM": 22,
    "GLOBAL": 23,
    "IF": 24,
    "IMPORT": 25,
    "IN": 26,
    "IS": 27,
    "LAMBDA": 28,
    "NONLOCAL": 29,
    "NOT": 30,
    "OR": 31,
    "PASS": 32,
    "RAISE": 33,
    "RETURN": 34,
    "TRY": 35,
    "WHILE": 36,
    "WITH": 37,
    "YIELD": 38,
    "PLUS": 39,
    "MINUS": 40,
    "TIMES": 41,
    "DIVIDE": 42,
    "MODULO": 43,
    "POWER": 44,
    "FLOORDIV": 45,
    "MATMUL": 46,
    "LSHIFT": 47,
    "RSHIFT": 48,
    "BITOR": 49,
    "BITXOR": 50,
    "BITAND": 51,
    "BITNOT": 52,
    "EQ": 53,
    "NE": 54,
    "LT": 55,
    "LE": 56,
    "GT": 57,
    "GE": 58,
    "ASSIGN": 59,
    "PLUSASSIGN": 60,
    "MINUSASSIGN": 61,
    "TIMESASSIGN": 62,
    "DIVIDEASSIGN": 63,
    "MODULOASSIGN": 64,
    "POWERASSIGN": 65,
    "FLOORDIVASSIGN": 66,
    "MATMULASSIGN": 67,
    "LSHIFTASSIGN": 68,
    "RSHIFTASSIGN": 69,
    "ANDASSIGN": 70,
    "ORASSIGN": 71,
    "XORASSIGN": 72,
    "WALRUS": 73,
    "LPAREN": 74,
    "RPAREN": 75,
    "LBRACKET": 76,
    "RBRACKET": 77,
    "LBRACE": 78,
    "RBRACE": 79,
    "COMMA": 80,
    "COLON": 81,
    "SEMICOLON": 82,
    "DOT": 83,
    "ELLIPSIS": 84,
    "ARROW": 85,
    "NEWLINE": 86,
    "WHITESPACE": 87,
    "COMMENT_START": 88,
    "CHAR:0": 89,
    "CHAR:1": 90,
    "CHAR:2": 91,
    "CHAR:3": 92,
    "CHAR:4": 93,
    "CHAR:5": 94,
    "CHAR:6": 95,
    "CHAR:7": 96,
    "CHAR:8": 97,
    "CHAR:9": 98,
    "CHAR:a": 99,
    "CHAR:b": 100,
    "CHAR:c": 101,
    "CHAR:d": 102,
    "CHAR:e": 103,
    "CHAR:f": 104,
    "CHAR:g": 105,
    "CHAR:h": 106,
    "CHAR:i": 107,
    "CHAR:j": 108,
    "CHAR:k": 109,
    "CHAR:l": 110,
    "CHAR:m": 111,
    "CHAR:n": 112,
    "CHAR:o": 113,
    "CHAR:p": 114,
    "CHAR:q": 115,
    "CHAR:r": 116,
    "CHAR:s": 117,
    "CHAR:t": 118,
    "CHAR:u": 119,
    "CHAR:v": 120,
    "CHAR:w": 121,
    "CHAR:x": 122,
    "CHAR:y": 123,
    "CHAR:z": 124,
    "CHAR:A": 125,
    "CHAR:B": 126,
    "CHAR:C": 127,
    "CHAR:D": 128,
    "CHAR:E": 129,
    "CHAR:F": 130,
    "CHAR:G": 131,
    "CHAR:H": 132,
    "CHAR:I": 133,
    "CHAR:J": 134,
    "CHAR:K": 135,
    "CHAR:L": 136,
    "CHAR:M": 137,
    "CHAR:N": 138,
    "CHAR:O": 139,
    "CHAR:P": 140,
    "CHAR:Q": 141,
    "CHAR:R": 142,
    "CHAR:S": 143,
    "CHAR:T": 144,
    "CHAR:U": 145,
    "CHAR:V": 146,
    "CHAR:W": 147,
    "CHAR:X": 148,
    "CHAR:Y": 149,
    "CHAR:Z": 150,
    "CHAR:!": 151,
    "CHAR:\"": 152,
    "CHAR:#": 153,
    "CHAR:$": 154,
    "CHAR:%": 155,
    "CHAR:&": 156,
    "CHAR:'": 157,
    "CHAR:(": 158,
    "CHAR:)": 159,
    "CHAR:*": 160,
    "CHAR:+": 161,
    "CHAR:,": 162,
    "CHAR:-": 163,
    "CHAR:.": 164,
    "CHAR:/": 165,
    "CHAR::": 166,
    "CHAR:;": 167,
    "CHAR:<": 168,
    "CHAR:=": 169,
    "CHAR:>": 170,
    "CHAR:?": 171,
    "CHAR:@": 172,
    "CHAR:[": 173,
    "CHAR:\\\\": 174,
    "CHAR:]": 175,
    "CHAR:^": 176,
    "CHAR:_": 177,
    "CHAR:`": 178,
    "CHAR:{": 179,
    "CHAR:|": 180,
    "CHAR:}": 181,
    "CHAR:~": 182,
    "CHAR: ": 183,
    "CHAR:\\t": 184,
    "CHAR:\\r": 185,
    "CHAR:\\x0b": 186,
    "CHAR:\\x0c": 187
  },
  "special_tokens": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3
  },
  "next_id": 188
}